МояКонфа/src/Documents/пр_Договор/пр_Договор.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>пр_Договор</name>
  <basedOn>Catalog.пр_ДоговорПрисоединенныеФайлы</basedOn>
  <registerRecords>InformationRegister.пр_СвязьОборудованияИГрафикаРабот</registerRecords>
  <registerRecords>InformationRegister.пр_СостояниеОборудования</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СтатусыДоговора</types>
    </type>
  </attributes>
  <attributes>
    <name>Куратор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодОборудования</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТехХарактеристика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>флТехХарактеристика</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>флКодОборудования</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>флНаименование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПоставки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерБлока</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

МояКонфа/src/Enums/СтатусыДоговора/СтатусыДоговора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыДоговора</name>
  <enumValues>
    <name>НеСогласован</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
</mdclass:Enum>

МояКонфа/src/Documents/пр_Договор/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Диалог = новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = "Документ Excel (*.xls, *.xlsx)|*.xls;*.xlsx";
	Диалог.МножественныйВыбор=Ложь;
	Если Диалог.Выбрать() Тогда
		ИмяФайла = Диалог.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	ЗагрузкаНаКлиентеЕксель();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаНаКлиентеЕксель()
	
	Попытка
		Эксель = Новый COMОбъект("Excel.Application");
		Эксель.DisplayAlerts = 0;
		Эксель.Visible = 0;
	Исключение
   		Сообщить(ОписаниеОшибки()); 
   		Возврат;
	КонецПопытки;
	
	стЗаписываемыеКолонки = Новый Соответствие;
	стЗаписываемыеКолонки.Вставить("№ п/п. ","НомерПП");
	стЗаписываемыеКолонки.Вставить("Наименование оборудования","Наименование");
	стЗаписываемыеКолонки.Вставить("Код по KKS, MCS","КодОборудования");
	стЗаписываемыеКолонки.Вставить("Технические характеристики*, № ТУ/ТЗ, чертеж и пр.","ТехХарактеристика");
	стЗаписываемыеКолонки.Вставить("Количество","Количество");
	стЗаписываемыеКолонки.Вставить("Срок поставки на АЭС***","ДатаПоставки");
	стЗаписываемыеКолонки.Вставить("ID","ИДРаботы"); 
	стЗаписываемыеКолонки.Вставить("Блок №","НомерБлока");

	ЭксельКнига = Эксель.Workbooks.Open(ИмяФайла);	
	КоличествоСтраниц = ЭксельКнига.Sheets.Count;
	
	Для НомерЛиста = 1 По КоличествоСтраниц Цикл 
		Лист = ЭксельКнига.Sheets(НомерЛиста);
		КоличествоСтрок = Лист.Cells(1, 1).SpecialCells(11).Row;
		КоличествоКолонок = Лист.Cells(1, 1).SpecialCells(11).Column;
		
		строкаШапкаОписанияЛота = Лист.Cells(4, 1) ;
		//НомерЛота = "";
		Для НомерКолонки = 1 По КоличествоКолонок Цикл
			
			ЗначениеВЯчейке = Лист.Cells(4, строкаШапкаОписанияЛота.Columns(НомерКолонки).Column).Value;
			ПозицияПервогоСимвола = СтрНайти(ЗначениеВЯчейке,"по лоту № "); 
			Если ПозицияПервогоСимвола<>0 Тогда 
				массивСлов = СтрРазделить(СокрЛП(ЗначениеВЯчейке), " ", Ложь);
				Объект.Номер = массивСлов[3];
			КонецЕсли;	
			
		КонецЦикла;
		//Объект.Номер = НомерЛота;
		
		строкаШапка = Лист.Cells(8, 1) ;
		ЕстьОшибки=Ложь;
		Для НомерСтроки = 11 По КоличествоСтрок Цикл 
			ДанныеСтроки = Новый Структура;
			Для НомерКолонки = 1 По КоличествоКолонок Цикл
				ИмяКолонки1С = стЗаписываемыеКолонки.Получить(строкаШапка.Columns(НомерКолонки).value);
				ИмяКолонкиЕкс = строкаШапка.Columns(НомерКолонки).value;
				
				ЗначениеВЯчейке = Лист.Cells(НомерСтроки, строкаШапка.Columns(НомерКолонки).Column).Value;

				Если  ИмяКолонки1С <> Неопределено Тогда
					Если ТипЗнч(ЗначениеВЯчейке)=Тип("Строка") Тогда
						ЗначениеВЯчейке=СокрЛП(ЗначениеВЯчейке);
					КонецЕсли;
					
					ДанныеСтроки.Вставить(ИмяКолонки1С,  ЗначениеВЯчейке);
					
				КонецЕсли;
				
			КонецЦикла;
			
			
			НомерПП="";
			ДанныеСтроки.Свойство("НомерПП",НомерПП);
			Если НомерПП=Неопределено Тогда Прервать; КонецЕсли;
			
			Артикул="";
			ДанныеСтроки.Свойство("КодОборудования",Артикул);



			НайденныйДок = ПолучитьДокументПоНоменклатуре(Артикул);			
			Если НайденныйДок<>Неопределено Тогда
				Если НайденныйДок.Ссылка<>Объект.Ссылка Тогда 
					Сообщить("Файл содержит оборудование("+Артикул+"), которое зарегистрировано в документе"+НайденныйДок+". Операция прервана!");
					ЕстьОшибки=Истина;
					Продолжить;
				КонецЕсли;
			КонецЕсли;
				
					
			Если Не ЕстьОшибки Тогда
				
				Артикул="";
				ДанныеСтроки.Свойство("КодОборудования",Артикул);
				Номенклатура = НайтиНоменклатуру(Артикул);
				ДанныеСтроки.Вставить("Номенклатура",Номенклатура);
				

				Строки = ЭтотОбъект.Объект.Товары.НайтиСтроки(Новый Структура("КодОборудования,Номенклатура",Артикул,Номенклатура));
				Если Строки.Количество() > 0 Тогда
					строкаТЧ = Строки[0];
				Иначе
					строкаТЧ = ЭтотОбъект.Объект.Товары.Добавить();
				КонецЕсли;
								
				ТехХарактеристика="";
				ДанныеСтроки.Свойство("ТехХарактеристика",ТехХарактеристика);
				Наименование="";
				ДанныеСтроки.Свойство("Наименование",Наименование);
					
				ДанныеСтроки.Вставить("флТехХарактеристика",Не СравнитьДанные(НайтиНоменклатуру(Артикул),"флТехХарактеристика",ТехХарактеристика));
				ДанныеСтроки.Вставить("флКодОборудования",Не СравнитьДанные(НайтиНоменклатуру(Артикул),"флКодОборудования",Артикул));
				ДанныеСтроки.Вставить("флНаименование",Не СравнитьДанные(НайтиНоменклатуру(Артикул),"флНаименование",Наименование));
				
				Флаг=Ложь;
				ДанныеСтроки.Свойство("флТехХарактеристика",Флаг); Если не Флаг и Строки.Количество() > 0 Тогда ДанныеСтроки.Вставить("флТехХарактеристика", строкаТЧ.ТехХарактеристика<>ТехХарактеристика) КонецЕсли;
				ДанныеСтроки.Свойство("флКодОборудования",Флаг); Если не Флаг и Строки.Количество() > 0  Тогда ДанныеСтроки.Вставить("флКодОборудования", строкаТЧ.КодОборудования<>Артикул) КонецЕсли;
				ДанныеСтроки.Свойство("флНаименование",Флаг); Если не Флаг и Строки.Количество() > 0  Тогда ДанныеСтроки.Вставить("флНаименование", строкаТЧ.Наименование<>Наименование) КонецЕсли;				
				
				//Если Не ЗначениеЗаполнено(ЭтотОбъект.Объект.Состояние) Тогда 
				//	ДанныеСтроки.Вставить("Состояние",ПолучитьСтатусНеСогласован());
				//КонецЕсли;
				ЗаполнитьЗначенияСвойств(СтрокаТЧ,ДанныеСтроки);
			КонецЕсли;
			//Возврат;
		КонецЦикла;	
		Прервать;
	КонецЦикла;
	
	РаскраситьНеВалидныеСтрокиКрасным();

	Эксель.Workbooks.Close();
	Эксель.Application.Quit();
КонецПроцедуры

Функция ПолучитьСтатусНеСогласован()
	возврат Перечисления.СтатусыДоговора.НеСогласован;
КонецФункции

Функция ПолучитьДокументПоНоменклатуре(Артикул)
	возврат ОбщегоНазначения_аккую.ПолучитьСуществующийДокументПоНомеру(НайтиНоменклатуру(Артикул),Артикул,Объект.Ссылка.Метаданные().Имя);	
КонецФункции


Функция СравнитьДанные(Номенклатура,Реквизит,Значение)
	флаг=Ложь;
	Если Не ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат Флаг;
	КонецЕсли;
	
	Если Реквизит = "флТехХарактеристика" Тогда
		Если Номенклатура.пр_ТехническиеХарактеристики=Значение тогда
			флаг = Истина;
		КонецЕсли;
	ИначеЕсли Реквизит = "флКодОборудования" Тогда
		Если Номенклатура.Артикул=Значение тогда
			флаг = Истина;
		КонецЕсли;
	ИначеЕсли Реквизит = "флНаименование" Тогда
		Если Номенклатура.Наименование=Значение тогда
			флаг = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат флаг;
КонецФункции

Процедура РаскраситьНеВалидныеСтрокиКрасным()
	ОбщегоНазначения_аккую.РаскраситьНеВалидныеСтрокиКрасным(ЭтаФорма);
КонецПроцедуры


Функция НайтиНоменклатуру(Артикул)
	
	Возврат Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",Артикул);
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	РаскраситьНеВалидныеСтрокиКрасным();
КонецПроцедуры

&НаКлиенте 
Функция СформироватьСписокРеквизитовДляИзменения(ВыделеннаяСтрока,Пометить=Ложь)
	соот = Новый Соответствие;
	соот.Вставить("КодОборудования",ВыделеннаяСтрока.КодОборудования);
	соот.Вставить("ТехХарактеристика",ВыделеннаяСтрока.ТехХарактеристика);
	соот.Вставить("Наименование",ВыделеннаяСтрока.Наименование);
	соот.Вставить("Номенклатура",ВыделеннаяСтрока.Номенклатура);
	
	
	ВыделеннаяСтрока.флТехХарактеристика = Пометить;
	ВыделеннаяСтрока.флКодОборудования = Пометить;
	ВыделеннаяСтрока.флНаименование = Пометить;
	
	

	Возврат соот;	
КонецФункции

&НаКлиенте 
Процедура ОтветНаВопрос(Результат, ДополнительныеПараметры)  Экспорт 
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	ИндексСтроки = Объект.Товары.Индекс(Элементы.Товары.ТекущиеДанные);
	ВыделеннаяСтрока = Объект.Товары.Получить(ИндексСтроки);	
	

	соСписокРеквизитов = СформироватьСписокРеквизитовДляИзменения(ВыделеннаяСтрока,Ложь);
	ВыделеннаяСтрока.Номенклатура = ЗаписатьВоборудования(соСписокРеквизитов);
		
	РаскраситьНеВалидныеСтрокиКрасным();
	
	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Запись);
	ЭтаФорма.Записать(ПараметрыЗаписи);		
	
КонецПроцедуры  

&НаКлиенте
Процедура Обработать(Команда)

	Оповещение = Новый ОписаниеОповещения("ОтветНаВопрос", ЭтотОбъект);
	ТекстВопроса = НСтр("ru = 'Желаете внести изменения в оборудование?'");
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаСервере
Функция ЗаписатьВоборудования(ВыделеннаяСтрока)
	
	Номенклатура = ВыделеннаяСтрока.Получить("Номенклатура");
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		Номенклатура = Номенклатура.ПолучитьОбъект();
	Иначе
	    Номенклатура = Справочники.Номенклатура.СоздатьЭлемент();
	КонецЕсли;
	
	Номенклатура.ВидНоменклатуры 	= Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Оборудование");
	Номенклатура.ТипНоменклатуры 	= Перечисления.ТипыНоменклатуры.Товар;
	Номенклатура.Артикул 			=  ВыделеннаяСтрока.Получить("КодОборудования");
	Номенклатура.пр_ТехническиеХарактеристики =  ВыделеннаяСтрока.Получить("ТехХарактеристика");
	Номенклатура.Наименование 		=  ВыделеннаяСтрока.Получить("Наименование");
	Номенклатура.НаименованиеПолное =  ВыделеннаяСтрока.Получить("Наименование");

	Номенклатура.Записать();
	

	Возврат Номенклатура.Ссылка;
КонецФункции
